notice:此文具有临时性，正式开始后会有正式的readme文件。

---

# 麦云飞的结业项目idea

我个人的希望是输出一份关于计算认知科学的全局认识。

这个全局认识经由回答这三个主要问题来生成。

1. 时间：计算机科学的发展脉络是什么？
2. 空间：计算认知科学的大牛有哪些？与计算认知科学密切相关的机构有哪些？
3. 变量关系：计算认知科学作为因变量的自变量是什么？计算认知科学作为自变量的因变量是什么？

---

以上是主要内容，以下是次要内容（我顺便把之后马上会涉及到的一些细节也一口气理了一下）。我们这次首先得定好方向，也就是确定好选题。

---

项目的起步阶段有个小矛盾：**欲了解计算认知科学，就需找出这个领域的大牛、机构、期刊。然而要找出计算认知科学的大牛、机构、期刊，则需要了解什么是计算认知科学。**毕竟计算认知科学还不像它的母亲（计算机科学、心理学，等）那样已成为显学，所以这个主题内的事物很难通过简单步骤就搜寻出来。

交织、闭合的矛盾问题并不难下手。那么该怎么解决呢？我的想法是最小行动先行——做出有效的初始行动。先搓一个小雪球，然后让它越滚越大。

要解决那个*小矛盾*，起点无非二选一：先认识计算认知科学，再去依此寻找大牛。或是先初步判定一些大牛，再依此去认识计算认知科学。（需要辨析的是，这指的是初始启动的行动。在整个信息分析、完成BP的过程中，认识科学和认识人的过程会轮转几次。也就是发展运动的螺旋上升，好吧有点哲学。总之，略唠叨的这段话是为了指出不需要在这一个点上纠结太久。）

我觉得马上就从「人」下手的话，范围太大容易迷失。还是需要稍微先约束一下什么是「计算认知科学」。

我目前想到的线索是：①维基百科；②阳老师博客关键词搜索；③老师相对推崇的侯世达及其著作。从里面初步获取一些相关人物和核心话语，然后就可以展开信息获取工作了。（第二周的课程提到：获取人工智能的千篇论文，光靠`人工智能`这个词并不能较精确地集中全局，还需要`神经网络`、`深度学习`等keywords，即人工智能领域的核心话语）

补充个④TED、YouTube。不过这个在初次限定范围之后进行，用于相对正式地确定认知计算科学的范围。

# 结业项目流程

1. 敲定方向
2. 选定组长（去讨论区上一休的结业项目登记帖子上报到）
3. 展开 行动/需输出内容 的清单，然后分工承包
4. 输出文件，合成项目（信息分析过程）
	* 信息获取：初次限定领域 → 正式限定领域 ＆ 收集文献、阅读书籍
	* 信息整理：zotero共享目录、GitHub（自己建的仓库里的）awesome清单
	* 信息加工：输出卡片、输出小文章
	* 信息报告：输出PPT
5. 路演准备
	* 提交demo
	* 提前压力测试，不断迭代
